app/Services/ReportService.php

    public function getDashboardData(): array
    {
        $today = date('Y-m-d');
        $firstDayOfMonth = date('Y-m-01');
        $lastDayOfMonth = date('Y-m-t');

        // This month's transactions
        $monthlyTransactions = $this->transactionModel
            ->where('date >=', $firstDayOfMonth)
            ->where('date <=', $lastDayOfMonth)
            ->findAll();
---
SELECT *
FROM `transactions`
WHERE `date` >= '2026-01-01'
AND `date` <= '2026-01-31'