app/Controllers/ProjectController.php

    public function index()
    {
        $status = $this->request->getGet('status');

        $builder = $this->projectModel
            ->select('projects.*, parties.name as party_name')
            ->join('parties', 'parties.id = projects.party_id', 'left');

        if ($status) {
            $builder->where('projects.status', $status);
        }

        $projects = $builder->orderBy('projects.created_at', 'DESC')->findAll();
---
SELECT `projects`.*, `parties`.`name` as `party_name`
FROM `projects`
LEFT JOIN `parties` ON `parties`.`id` = `projects`.`party_id`
ORDER BY `projects`.`created_at` DESC