app/Models/AuditLogModel.php

    public function logAction(
        string $action,
        string $entity,
        ?int $entityId = null,
        ?array $oldData = null,
        ?array $newData = null
    ): bool {
        $session = session();

        $data = [
            'user_id'    => $session->get('user_id'),
            'action'     => $action,
            'entity'     => $entity,
            'entity_id'  => $entityId,
            'old_data'   => $oldData ? json_encode($oldData) : null,
            'new_data'   => $newData ? json_encode($newData) : null,
            'ip_address' => service('request')->getIPAddress(),
            'created_at' => date('Y-m-d H:i:s'),
        ];

        return $this->insert($data) !== false;
---
INSERT INTO `audit_logs` (`user_id`, `action`, `entity`, `entity_id`, `old_data`, `new_data`, `ip_address`, `created_at`) VALUES ('1', 'login', 'user', 1, NULL, NULL, '::1', '2026-01-16 17:26:12')