app/Models/DebtModel.php

SELECT `debts`.*, `parties`.`name` as `party_name`
FROM `debts`
LEFT JOIN `parties` ON `parties`.`id` = `debts`.`party_id`
WHERE `debts`.`status` = 'open'
AND `debts`.`kind` = 'debt'
ORDER BY `debts`.`due_date` ASC
---
    public function getOpenDebts(): array
    {
        return $this->select('debts.*, parties.name as party_name')
                    ->join('parties', 'parties.id = debts.party_id', 'left')
                    ->where('debts.status', 'open')
                    ->where('debts.kind', 'debt')
                    ->orderBy('debts.due_date', 'ASC')
                    ->findAll();

SELECT `debts`.*, `parties`.`name` as `party_name`
FROM `debts`
LEFT JOIN `parties` ON `parties`.`id` = `debts`.`party_id`
WHERE `debts`.`status` = 'open'
AND `debts`.`kind` = 'receivable'
ORDER BY `debts`.`due_date` ASC
---
    public function getOpenReceivables(): array
    {
        return $this->select('debts.*, parties.name as party_name')
                    ->join('parties', 'parties.id = debts.party_id', 'left')
                    ->where('debts.status', 'open')
                    ->where('debts.kind', 'receivable')
                    ->orderBy('debts.due_date', 'ASC')
                    ->findAll();

SELECT *
FROM `debts`
WHERE `debts`.`id` = 2
SELECT SUM(`paid_amount`) AS `paid_amount`
FROM `installments`
WHERE `debt_id` = 2
 LIMIT 1
---
    public function calculateRemainingAmount(int $debtId): float
    {
        $debt = $this->find($debtId);
        if (!$debt) {
            return 0;
        }

        $installmentModel = new InstallmentModel();
        $totalPaid = $installmentModel
            ->where('debt_id', $debtId)
            ->selectSum('paid_amount')
            ->first();