app/Models/ExchangeRateModel.php

SELECT *
FROM `exchange_rates`
WHERE `quote_currency` = 'USD'
ORDER BY `rate_date` DESC
 LIMIT 1
---
    public function getLatestRates(): array
    {
        $currencies = ['USD', 'EUR'];
        $rates = [];

        foreach ($currencies as $currency) {
            $rate = $this->where('quote_currency', $currency)
                         ->orderBy('rate_date', 'DESC')
                         ->first();