app/Models/InstallmentModel.php

    public function getUpcoming(int $days = 30): array
    {
        $futureDate = date('Y-m-d', strtotime("+{$days} days"));

        return $this->select('installments.*, debts.kind, debts.principal_amount as debt_amount, parties.name as party_name')
                    ->join('debts', 'debts.id = installments.debt_id')
                    ->join('parties', 'parties.id = debts.party_id', 'left')
                    ->whereIn('installments.status', ['pending', 'partial'])
                    ->where('installments.due_date <=', $futureDate)
                    ->where('debts.status', 'open')
                    ->orderBy('installments.due_date', 'ASC')
                    ->findAll();
---
SELECT `installments`.*, `debts`.`kind`, `debts`.`principal_amount` as `debt_amount`, `parties`.`name` as `party_name`
FROM `installments`
JOIN `debts` ON `debts`.`id` = `installments`.`debt_id`
LEFT JOIN `parties` ON `parties`.`id` = `debts`.`party_id`
WHERE `installments`.`status` IN ('pending','partial')
AND `installments`.`due_date` <= '2026-02-15'
AND `debts`.`status` = 'open'
ORDER BY `installments`.`due_date` ASC

    public function getOverdue(): array
    {
        return $this->select('installments.*, debts.kind, parties.name as party_name')
                    ->join('debts', 'debts.id = installments.debt_id')
                    ->join('parties', 'parties.id = debts.party_id', 'left')
                    ->whereIn('installments.status', ['pending', 'partial'])
                    ->where('installments.due_date <', date('Y-m-d'))
                    ->where('debts.status', 'open')
                    ->orderBy('installments.due_date', 'ASC')
                    ->findAll();
---
SELECT `installments`.*, `debts`.`kind`, `parties`.`name` as `party_name`
FROM `installments`
JOIN `debts` ON `debts`.`id` = `installments`.`debt_id`
LEFT JOIN `parties` ON `parties`.`id` = `debts`.`party_id`
WHERE `installments`.`status` IN ('pending','partial')
AND `installments`.`due_date` < '2026-01-16'
AND `debts`.`status` = 'open'
ORDER BY `installments`.`due_date` ASC