app/Models/ProjectModel.php

SELECT *
FROM `projects`
WHERE `status` = 'active'
ORDER BY `start_date` DESC
---
    public function getOpenProjects(): array
    {
        return $this->where('status', 'active')->orderBy('start_date', 'DESC')->findAll();

SELECT *
FROM `projects`
WHERE `projects`.`id` = 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `project_id` = 1
AND `type` = 'income'
 LIMIT 1
---
    public function calculateBalance(int $projectId): array
    {
        $project = $this->find($projectId);
        if (!$project) {
            return [
                'contract_amount' => 0,
                'collected_amount' => 0,
                'remaining_amount' => 0,
                'percentage' => 0,
            ];
        }

        $transactionModel = new TransactionModel();
        $collected = $transactionModel
            ->where('project_id', $projectId)
            ->where('type', 'income')
            ->selectSum('amount')
            ->first();