app/Models/TransactionModel.php

    public function getRecent(int $limit = 10): array
    {
        return $this->select('transactions.*, parties.name as party_name, categories.name as category_name')
                    ->join('parties', 'parties.id = transactions.party_id', 'left')
                    ->join('categories', 'categories.id = transactions.category_id', 'left')
                    ->orderBy('transactions.date', 'DESC')
                    ->orderBy('transactions.id', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `transactions`.*, `parties`.`name` as `party_name`, `categories`.`name` as `category_name`
FROM `transactions`
LEFT JOIN `parties` ON `parties`.`id` = `transactions`.`party_id`
LEFT JOIN `categories` ON `categories`.`id` = `transactions`.`category_id`
ORDER BY `transactions`.`date` DESC, `transactions`.`id` DESC
 LIMIT 5